---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RampAttrMaterial
source: html/404c22c1-ff43-3af2-5868-da905bc49f07.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RampAttrMaterial Property

"Ramp Material"

## Syntax (C#)
```csharp
public static ForgeTypeId RampAttrMaterial { get; }
```